Show / Hide Table of Contents
Class ParameterString
String parameter of cross-section
Inheritance
System.Object
OpenObject
Parameter
ParameterString
Inherited Members
 Parameter.Name
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ParameterString : Parameter
Properties
Improve this Doc   View Source
Value
Value
Declaration
public string Value { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source